app/controllers/auctions_controller.rb

INSERT INTO "auctions" ("minimal_price", "created_at", "updated_at", "end", "user_id", "start", "description") VALUES(0.0, '2009-11-08 14:53:22.429337', '2009-11-08 14:53:22.429337', '2009-11-09 00:00:00.000000', 1, '2009-11-08 00:00:00.000000', E'<p><strong>GUWNO !</strong></p>') RETURNING "id"
---
  def create
    @auction = Auction.new(params[:auction])
    @auction.user = current_user
    #puts current_user.id
    if @auction.save