app/controllers/password_resets_controller.rb

SELECT * FROM "users" WHERE ("users"."email" = E'ja.zajko@gmail.com') LIMIT 1
---
  def create
    puts "aaa"
    @user = User.find_by_email(params[:email])