app/controllers/role_controller.rb

INSERT INTO "roles" ("name", "updated_at", "authorizable_type", "authorizable_id", "created_at") VALUES(E'wwWWWww', '2009-11-02 22:03:20.749000', NULL, NULL, '2009-11-02 22:03:20.749000') RETURNING "id"
---
  def create
    @role = Role.new(params[:role])

    begin
      @role.save